In [2]:
a=10
b=20
print(f'{a+b}')

30

- Numpy : Used for Numerical or Math Operations
- Pandas : Used for Data Base reading, writing, Modifying the Data
- Matplotlib : used for Plotting
- Seaborn : Used for Plotting

In [ ]:
Syntax

pd.DataFrame(data,index,columns)

### Step 1 : Import Packages ###

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Step 2 : Create DATA FRAME using LIST ###

In [6]:
names = ['Vinay','Goud','Ponnam']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names)

        0
0   Vinay
1    Goud
2  Ponnam

### Step 3 : Update COLUMN Name ###

In [7]:
names = ['Vinay','Goud','Ponnam']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names,columns=['Names'])

    Names
0   Vinay
1    Goud
2  Ponnam

### Step 4 : Update INDEX Name ###

In [8]:
names = ['rajesh','karthik','mahesh']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names,index=['A','B','C'])

         0
A   rajesh
B  karthik
C   mahesh

In [9]:
names = ['rajesh','karthik','mahesh']
idx = [i for i in range(1,len(names)+1)]
cols = ['Names']

pd.DataFrame(names,idx,cols)

     Names
1   rajesh
2  karthik
3   mahesh

### Step 5 : Create DATA FRAME with MULTIPLE COLUMNS ###

In [10]:
names = ['rajesh','karthik','mahesh']
city = ['Nellore','Hyd','Mumbai']
idx = [i for i in range(1,len(names)+1)]
cols = ['Names','City']

nc = [names,city]

print('with out .T ')
print(pd.DataFrame(nc,index=cols,columns=idx))
print()
print('with .T ')
print(pd.DataFrame(nc,index=cols,columns=idx).T)
# Here .T means "Transpose of Mateix" It will reverse the matrix

with out .T
             1        2       3
Names   rajesh  karthik  mahesh
City   Nellore      Hyd  Mumbai

with .T
     Names     City
1   rajesh  Nellore
2  karthik      Hyd
3   mahesh   Mumbai

- Here we use "zip()" function with out using ".T" method

In [11]:
names = ['rajesh','karthik','mahesh']
city = ['Nellore','Hyd','Mumbai']
idx = [i for i in range(1,len(names)+1)]
cols = ['Names','City']

nc = zip(names,city)

print(pd.DataFrame(nc,idx,cols))

     Names     City
1   rajesh  Nellore
2  karthik      Hyd
3   mahesh   Mumbai

In [12]:
names = ['rajesh','karthik','mahesh']
city = ['Nellore','Hyd','Mumbai']
age = [21,22,23]
idx = [i for i in range(1,len(names)+1)]
cols = ['Names','Age','City']

nc = zip(names,age,city)

print(pd.DataFrame(nc,idx,cols))

     Names  Age     City
1   rajesh   21  Nellore
2  karthik   22      Hyd
3   mahesh   23   Mumbai

### Step 6 : Adding DATA to Empty DATA FRAME ###

In [14]:
df = pd.DataFrame()
print(df)
df['names'] = ['rajesh','karthik','mahesh']
df['Age'] = [21,22,23]
df['City'] = ['Nellore','Hyd','Mumbai']
df

Empty DataFrame
Columns: []
Index: []

     names  Age     City
0   rajesh   21  Nellore
1  karthik   22      Hyd
2   mahesh   23   Mumbai

### Step 7 : Creating a DATA FRAME using DICTIONARY ###

In [15]:
d = {'Names' : ['Rajesh','Karthik','Mahesh'],
     'Age' : [21,22,23],
     'City' : ['Nellore','Hyd','Mumbai']}
idx = [i for i in range(1,len(names)+1)]

pd.DataFrame(d,idx)

     Names  Age     City
1   Rajesh   21  Nellore
2  Karthik   22      Hyd
3   Mahesh   23   Mumbai

### Step 8 : DATA FRAMES Methods###
- shape
- size
- columns
- dtype
- isnull

In [16]:
d = {'Names' : ['Rajesh','Karthik','Mahesh'],
     'Age' : [21,22,23],
     'City' : ['Nellore','Hyd','Mumbai']}
idx = [i for i in range(1,len(names)+1)]

df = pd.DataFrame(d,idx)
print(df)

     Names  Age     City
1   Rajesh   21  Nellore
2  Karthik   22      Hyd
3   Mahesh   23   Mumbai

In [17]:
df.shape

(3, 3)

In [18]:
df.size

9

In [19]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [20]:
df.dtypes

Names    object
Age       int64
City     object
dtype: object

In [21]:
df.isnull()

   Names    Age   City
1  False  False  False
2  False  False  False
3  False  False  False

In [22]:
# Colums wise null values not available
df.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

### Step 9 : Rename ALL the COLUMNS and INDEX in DATA FRAME ###

In [23]:
df

     Names  Age     City
1   Rajesh   21  Nellore
2  Karthik   22      Hyd
3   Mahesh   23   Mumbai

In [24]:
df.columns=[1,2,3]
df

         1   2        3
1   Rajesh  21  Nellore
2  Karthik  22      Hyd
3   Mahesh  23   Mumbai

In [25]:
df.index = ['a','b','c']
df

         1   2        3
a   Rajesh  21  Nellore
b  Karthik  22      Hyd
c   Mahesh  23   Mumbai

**Another method to Rename COLUMN NAME and INDEX NAME**
- using ".rename()" function

In [26]:
# Original DATA FRAME

d = {'Names' : ['Rajesh','Karthik','Mahesh'],
     'Age' : [21,22,23],
     'City' : ['Nellore','Hyd','Mumbai']}
idx = [i for i in range(1,len(names)+1)]

df = pd.DataFrame(d,idx)
print(df)

     Names  Age     City
1   Rajesh   21  Nellore
2  Karthik   22      Hyd
3   Mahesh   23   Mumbai

In [27]:
# Rename COLUMN NAME
# df.rename(mapper,index,columns,axis,inplace)

d = {'Names':'A',
    'Age':'B',
    'City':'C'}
df.rename(columns=d,inplace=True)
df

         A   B        C
1   Rajesh  21  Nellore
2  Karthik  22      Hyd
3   Mahesh  23   Mumbai

In [28]:
# Rename INDEX NAME
# df.rename(mapper,index,columns,axis,inplace)

d = {1:'a',
    2:'b',
    3:'c'}
df.rename(index=d,inplace=True)
df

         A   B        C
a   Rajesh  21  Nellore
b  Karthik  22      Hyd
c   Mahesh  23   Mumbai

In [29]:
l = {'Names' : ['Rajesh','Karthik','Mahesh'],
     'Age' : [21,22,23],
     'City' : ['Nellore','Hyd','Mumbai']}
idx = [i for i in range(1,len(names)+1)]

df = pd.DataFrame(l,idx)
print(df)
print()

d1 = {1:'a',
    2:'b',
    3:'c'}
d2 = {'Names':'A',
    'Age':'B',
    'City':'C'}

df.rename(d1,inplace=True)              # If AXIS is not given by default it is "0" and it changes "INDEX"
print(df)
print()

df.rename(d2,axis=1,inplace=True)       # If AXIS is "1" and it changes "COLUMN"
print(df)
print()

     Names  Age     City
1   Rajesh   21  Nellore
2  Karthik   22      Hyd
3   Mahesh   23   Mumbai

     Names  Age     City
a   Rajesh   21  Nellore
b  Karthik   22      Hyd
c   Mahesh   23   Mumbai

         A   B        C
a   Rajesh  21  Nellore
b  Karthik  22      Hyd
c   Mahesh  23   Mumbai

In [30]:
import pandas as pd
l = {'A':['Ramesh','Suresh','Satish'],
     'B':[20,22,24],
     'C':['Hyd','Mumbai','Blr']}
df = pd.DataFrame(l)
df

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22  Mumbai
2  Satish  24     Blr

In [31]:
d1 = {'A':'Name',
      'B':'Age',
      'C':'City'}
d2 = {0:1,
      1:2,
      2:3}

print(df)
print()
df.rename(columns=d1,inplace=True)
print(df)
print()
df.rename(index=d2,inplace=True)
print(df)
print()

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22  Mumbai
2  Satish  24     Blr

     Name  Age    City
0  Ramesh   20     Hyd
1  Suresh   22  Mumbai
2  Satish   24     Blr

     Name  Age    City
1  Ramesh   20     Hyd
2  Suresh   22  Mumbai
3  Satish   24     Blr

In [32]:
import pandas as pd
l = {'A':['Ramesh','Suresh','Satish'],
     'B':[20,22,24],
     'C':['Hyd','Mumbai','Blr']}
df = pd.DataFrame(l)

d1 = {'A':'Name',
      'B':'Age',
      'C':'City'}
d2 = {0:1,
      1:2,
      2:3}

print(df)
print()
df.rename(d1,axis=1,inplace=True)
print(df)
print()
df.rename(d2,axis=0,inplace=True)
print(df)
print()

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22  Mumbai
2  Satish  24     Blr

     Name  Age    City
0  Ramesh   20     Hyd
1  Suresh   22  Mumbai
2  Satish   24     Blr

     Name  Age    City
1  Ramesh   20     Hyd
2  Suresh   22  Mumbai
3  Satish   24     Blr

### Step 10 : Adding DATA to existing DATA FRAME ###

In [2]:
import pandas as pd
l = {'Name':['Ramesh','Suresh','Satish'],
     'Age':[20,22,24],
     'City':['Hyd','Mumbai','Blr']}
df = pd.DataFrame(l)
print(df)
print()

df['Marks'] = [100,200,300]    # Adding new column
print(df)
print()

df['Age'] = [100,200,300]    # Modifing the Existing column
print(df)
print()

     Name  Age    City
0  Ramesh   20     Hyd
1  Suresh   22  Mumbai
2  Satish   24     Blr

     Name  Age    City  Marks
0  Ramesh   20     Hyd    100
1  Suresh   22  Mumbai    200
2  Satish   24     Blr    300

     Name  Age    City  Marks
0  Ramesh  100     Hyd    100
1  Suresh  200  Mumbai    200
2  Satish  300     Blr    300

### Step 11 : Save the DATA FRAME ###
- if we want to SAVE the DATA FRAME we need 3 values
    - Where we want to save
    - On which name we want to save
    - On which format we want to save

- Data frames can only be saved in 2 formates
    - .csv
    - .xlsx
- if we provide onlf file name it will save in CURRENT WORKING DIRECTORY (CWD)

**Saving the file at CURRENT WORKING DIRECTORY (CWD)**

In [34]:
df.to_csv('data.csv',index=False)
df.to_csv('data1.csv')
# We use "index=False" to remove the existing index of the file
# Because while reading the file a new index is ADDED to it
# So to not get 2 INDEXS we will remove the existing index

**Saving the file at SPECIFIED LOCATION**

In [37]:
df.to_csv(r'C:\Users\vinay\Documents\Naresh IT\Data_Files/data.csv')

### Step 12 : Read the DATA FRAME ###
- if we want to READ the DATA FRAME we need 3 values
    - Where we want to save
    - On which name we want to save
    - On which format we want to save

In [38]:
pd.read_csv('data.csv')

     Name  Age    City  Marks
0  Ramesh  100     Hyd    100
1  Suresh  200  Mumbai    200
2  Satish  300     Blr    300

In [39]:
pd.read_csv('data1.csv')

   Unnamed: 0    Name  Age    City  Marks
0           0  Ramesh  100     Hyd    100
1           1  Suresh  200  Mumbai    200
2           2  Satish  300     Blr    300

In [43]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [3]:
df.to_excel('dataxl.xlsx',index=False)
df.to_excel('dataxl1.xlsx')

In [4]:
pd.read_excel('dataxl.xlsx')

     Name  Age    City  Marks
0  Ramesh  100     Hyd    100
1  Suresh  200  Mumbai    200
2  Satish  300     Blr    300

In [122]:
pd.read_excel('dataxl1.xlsx')

   Unnamed: 0    Name  Age    City  Marks
0           0  Ramesh  100     Hyd    100
1           1  Suresh  200  Mumbai    200
2           2  Satish  300     Blr    300

In [5]:
bank_df1 = pd.read_csv(r"C:\Users\vinay\Documents\Naresh IT\Data_Files\bank.csv")
bank_df1

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [6]:
bank_df1 = pd.read_csv(r"C:\Users\vinay\Documents\Naresh IT\Data_Files\bank.csv",sep=';')
bank_df1

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [7]:
visa_df = pd.read_csv(r"C:\Users\vinay\Documents\Naresh IT\Data_Files\Visadataset.csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [8]:
visa_df.shape

(25480, 12)

In [9]:
visa_df.size

305760

In [10]:
len(visa_df)

25480

In [11]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [12]:
visa_df.index

RangeIndex(start=0, stop=25480, step=1)

In [13]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [14]:
visa_df.isnull

<bound method DataFrame.isnull of          case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]>

In [15]:
visa_df.info

<bound method DataFrame.info of          case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]>